Tekla Open API Reference for Tekla Structures 2025
WpfReinforcementCatalog Constructor
Overload List
Name | Description
WpfReinforcementCatalog()
 Initiates a new instance of the control.
WpfReinforcementCatalog(String, String, Double)
 Creates a new instance of the ReinforcementCatalog and will select in the tree the rebar that contains the given parameters (if possible).
Top
See Also
Reference
WpfReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace